ConnectTest/src/Catalogs/tokens/tokens.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>tokens</name>
  <attributes>
    <name>account</name>
    <type>
      <types>CatalogRef.accounts</types>
    </type>
  </attributes>
  <attributes>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>appVersion</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>chain</name>
    <type>
      <types>CatalogRef.chains</types>
    </type>
  </attributes>
  <attributes>
    <name>changeDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>createDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
  <attributes>
    <name>deviceModel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>deviceToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>lockDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>systemType</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.systemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>systemVersion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/chains/chains.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>chains</name>
  <attributes>
    <name>currencySymbol</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>brand</name>
    <type>
      <types>EnumRef.brandTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>phoneMask</name>
    <type>
      <types>CatalogRef.CountryCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>loyaltyProgram</name>
    <type>
      <types>EnumRef.loyaltyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>language</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/users/users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>users</name>
  <owners>Catalog.accounts</owners>
  <attributes>
    <name>barCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>canUpdatePersonalData</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>notSubscriptionEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>notSubscriptionSms</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>secondName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>sex</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>userCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>userType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/CommonModules/TokenReuse/Module.bsl
Function initContext() Export
	tokenСontext		= New Structure();
	tokenСontext.Insert("token", Catalogs.tokens.EmptyRef());
	tokenСontext.Insert("appType", Enums.appTypes.EmptyRef());
	tokenСontext.Insert("appVersion", 0);
	tokenСontext.Insert("chain", Catalogs.chains.EmptyRef());
	tokenСontext.Insert("changeDate", Date(1,1,1));
	tokenСontext.Insert("createDate", Date(1,1,1));
	tokenСontext.Insert("deviceModel", "");
	tokenСontext.Insert("deviceToken", "");
	tokenСontext.Insert("holding", Catalogs.holdings.EmptyRef());
	tokenСontext.Insert("lockDate", Date(1,1,1));
	tokenСontext.Insert("systemType", Enums.systemTypes.EmptyRef());
	tokenСontext.Insert("systemVersion", "");
	tokenСontext.Insert("timezone", Catalogs.timeZones.EmptyRef());
	tokenСontext.Insert("account", Catalogs.accounts.EmptyRef());
	tokenСontext.Insert("user", Catalogs.users.EmptyRef());
	tokenСontext.Insert("userType", "");
	Return tokenСontext;	
EndFunction

Function getContext(language, authKey) Export
		
	query = New Query();
	query.Text = "SELECT
	|	tokens.Ref AS token,
	|	tokens.appType,
	|	tokens.appVersion,
	|	tokens.chain,
	|	tokens.changeDate,
	|	tokens.createDate,
	|	tokens.deviceModel,
	|	tokens.deviceToken,
	|	tokens.holding,
	|	tokens.lockDate,
	|	tokens.systemType,
	|	tokens.systemVersion,
	|	tokens.timeZone,
	|	tokens.account,
	|	tokens.user,
	|	ISNULL(tokens.user.userType, """") AS userType
	|FROM
	|	Catalog.tokens AS tokens
	|WHERE
	|	NOT tokens.DeletionMark
	|	AND tokens.Ref = &token";

	query.SetParameter("token", XMLValue(Type("CatalogRef.tokens"), authKey));
	queryResult = query.Execute();
	tokenСontext = TokenReuse.initContext();
	If Not queryResult.IsEmpty() Then		
		selection = queryResult.Select();
		selection.Next();
		FillPropertyValues(tokenСontext, selection);				
	EndIf;
		
	Return tokenСontext;
	
EndFunction
